---
kind: enumMember
id: F:Autodesk.Revit.DB.BuiltInParameter.FABRIC_PARAM_MAJOR_LAPSPLICE_LENGTH
enum: Autodesk.Revit.DB.BuiltInParameter
source: html/fb011c91-be7e-f737-28c7-3f1e1917a0e0.htm
---
# Autodesk.Revit.DB.BuiltInParameter.FABRIC_PARAM_MAJOR_LAPSPLICE_LENGTH

"Major Lap Splice Length": Fabric lap splice length in major direction in the fabric distribution.